app/controllers/api/v1/orders_controller.rb

INSERT INTO "orders" ("user_id", "cartItems", "shipping", "payment", "itemsPrice", "taxPrice", "shippingPrice", "totalPrice", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    if @order.save

UPDATE "orders" SET "isDelivered" = $1, "deliveredAt" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["isDelivered", true], ["deliveredAt", "2022-11-21"], ["updated_at", "2022-11-21 05:12:54.860794"], ["id", "75b92ed5-c437-424f-a94c-279941b7e4f0"]]
---
  def update
    if @order.update(order_params)