app/controllers/api/v1/products_controller.rb

  def show
    @product.update_product
---
UPDATE "products" SET "numReviews" = $1, "rating" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["numReviews", 1], ["rating", 3.0], ["updated_at", "2022-11-21 04:02:13.872094"], ["id", "5bef0706-97f1-4965-ae33-006fc2d0465d"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Elf Bar BC5000 Strawberry Piña"], ["updated_at", "2022-11-21 05:14:59.519950"], ["id", "64a65d03-4f4e-422f-a7b3-383b105823fe"]]