app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("product_id", "name", "rating", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @review = @product.reviews.new(review_params)
    @review.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", "84c571fd-2a41-46e6-872c-c012466051f5"], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find(params[:product_id])