app/controllers/api/v1/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "shipping" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["shipping", "{\"address\":\"asd\",\"city\":\"asd\",\"postalCode\":\"123241\",\"country\":\"asd\"}"], ["updated_at", "2022-11-21 04:00:42.681791"], ["id", 1]]